{
  "type": "Article",
  "title": "Dessine-moi un mouton !",
  "date": "16/04/2018",
  "author": "Xavier Morin",
  "URL": "https://lenaindelaforetmagique.github.io/exercicesJS/p5/cycloide_shape/",
  "imgURL": "https://lenaindelaforetmagique.github.io/exercicesJS/p5/cycloide_shape/screenshot.png",
  "introduction": "<em>Dessine-moi un mouton !</em> est un petit programme qui essaie de reproduire une forme dessinée à la souris.",
  "content": [{
      "type": "Paragraph",
      "title": "Description",
      "lines": [
        "Tracez une forme fermée à la souris (ou à la main si vous êtes sur smartphone) et regardez le programme redessiner la forme avec des <em><a href=\"https://fr.wikipedia.org/wiki/%C3%89picyclo%C3%AFde\" target=\"blank\">épicycloïdes</a></em>."
      ]
    },
    {
      "type": "Paragraph",
      "title": "Un peu de maths",
      "lines": [
        "Une forme fermée est un polygone constitué de points. Comme cette forme est fermée, elle est périodique ; on peut donc chercher sa décomposition en série de Fourier.",
        "La décomposition en séries de Fourier d'une courbe consiste à exprimer cette courbe comme une somme de courbes sinusoïdales de fréquences et d'intensités différentes. Chaque sinusoïde (ou harmonique) permet alors d'approcher l'allure de la courbe que l'on cherche à reproduire. Plus on a d'harmoniques, plus on arrivera à s'approcher de la courbe initiale.",
        "Une harmonique peut-être vue comme un point tournant sur un cercle d'un certain rayon (qui détermine l'intensité) à une certaine vitesse angulaire (qui détermine la fréquence).",
        "En « empilant » ces cercles, on forme ce qu'on appelle des <em>épicycloïdes</em> et l'on découvre, un peu par magie, que quelques paramètres seulement permettent de reproduire notre forme initiale..."
      ]
    },
    {
      "type": "Paragraph",
      "title": "Inspiration",
      "lines": [
        "Je dois l'inspiration de ce petit projet à <a href=\"https://www.youtube.com/watch?v=uazPP0ny3XQ\" target=\"blank\">cette vidéo de El Jj</a>. J'ai été, encore une fois, bluffé par la puissance des mathématiques, il fallait que je m'y frotte !"
      ]
    },
    {
      "type": "Paragraph",
      "title": "Technologies mises en œuvre",
      "lines": [
        "Un poil de HTML et CSS, un peu plus de JavaScript avec la librairie <a href=\"https://p5js.org/\" target=\"blank\">p5.js</a>.",
        "Testé sur :",
        {
          "type": "List",
          "class": "",
          "items": [
            "Firefox (v64)",
            "Chrome (v71)",
            "Edge (v40)",
            "iOS Safari (v12)"
          ]
        },
        "Ne fonctionne pas sur Internet Explorer (v11)."
      ]
    }
  ]
}