{
  "type": "Article",
  "title": "Geodia",
  "date": "18/06/2019",
  "author": "Xavier Morin",
  "URL": "http://lenaindelaforetmagique.github.io/Geodia/",
  "imgURL": "http://lenaindelaforetmagique.github.io/Geodia/screenshot.png",
  "introduction": "<em>Geodia</em> est un générateur de dômes géodésiques.",
  "content": [{
      "type": "Paragraph",
      "title": "Description",
      "lines": [
        "Une géode est un polyèdre convexe permettant d'approximer une sphère.",
        "Cette page permet de générer et manipuler des géodes basées sur les solides de Platon :",
        {
          "type": "List",
          "class": "",
          "items": [
            "le tétraèdre (4 faces) ;",
            "l'hexaèdre (6 faces) ;",
            "l'octaèdre (8 faces) ;",
            "le dodécaèdre (12 faces) ;",
            "l'icosaèdre (20 faces)."
          ]
        },
        "Augmenter l'ordre de génération permet de subdiviser chaque face élémentaire en polygones plus petits et permet d'affiner l'approximation de la sphère."
      ]
    },
    {
      "type": "Paragraph",
      "title": "Motivations",
      "lines": [
        "Ce sujet me trottait dans la tête depuis un moment : au cours d'un voyage, j'ai eu l'occasion de séjourner dans un dôme géodésique construit en bois.",
        "Cloué au lit par une méchante crève, j'ai passé de longues heures à observer le plafond du dôme formé de triangles si parfaitement agencés qu'ils semblaient identiques. Mais il n'en est rien : les triangles sont en fait presque tous différents et la construction de telles structures est à comparer à un puzzle géant.",
        "Une récente promenade autour de <a href=\"https://fr.wikipedia.org/wiki/La_G%C3%A9ode\" target=\"blank\">La Géode</a> dans le parc de la Villette a achevé de me motiver !"
      ]
    },
    {
      "type": "Paragraph",
      "title": "Génération des géodes",
      "lines": [
        "Le principe de génération des géodes consiste à diviser les faces des polyèdres générateurs en sous-faces plus petites et de projeter ensuite les sommets sur la sphère circonscrite au polyèdre initial.",
        "La division du triangle équilatéral et du carré en polygones réguliers tous identiques plus petits ne pose pas de problème particulier.",
        "En revanche, le cas du pentagone est problématique puisqu'il est impossible de paver, avec des pentagones réguliers, sa surface (cas particulier) et même le plan (cas général).",
        "Le pavage que je présente, même si je n'en suis sans doute pas le découvreur, est une ré-invention de mon cru et permet de décomposer n'importe quel pentagone en pentagones plus petits."
      ]
    },
    {
      "type": "Paragraph",
      "title": "Technologies mises en œuvre",
      "lines": [
        "JavaScript et dessin vectoriel en SVG.",
        "Affichage 3D, occultations, éclairage des faces : tout de mon cru.",
        "Évènements clavier, souris et tactiles.",
        "Testé sur :",
        {
          "type": "List",
          "class": "",
          "items": [
            "Firefox (v64)",
            "Chrome (v71)",
            "Edge (v40)",
            "iOS Safari (v12)"
          ]
        },
        "Ne fonctionne pas sur Internet Explorer (v11)."
      ]
    }
  ]
}