{
  "type": "Article",
  "title": "Spaceship",
  "date": "26/09/2018",
  "author": "Xavier Morin",
  "URL": "http://lenaindelaforetmagique.github.io/Spaceship/",
  "imgURL": "http://lenaindelaforetmagique.github.io/Spaceship/screenshot.png",
  "introduction": "<em>Spaceship</em> est un moteur physique de jeu autour d'un vaisseau spatial.",
  "content": [{
      "type": "Paragraph",
      "title": "Description",
      "lines": [
        "Vous êtes le pilote du vaisseau et vous devez suivre votre mission (symbolisée par la flèche rouge).",
        "Il n'y a pas grand-chose à faire pour l'instant alors profitez-en pour jouer à piloter ce vaisseau aux degrés de liberté limités :",
        {
          "type": "List",
          "class": "",
          "items": [
            "le booster principal (barre d'espace) fournit une accélération longitudinale",
            "les RCS (flèches G/D) fournissent une accélération rotationnelle"
          ]
        }
      ]
    },
    {
      "type": "Paragraph",
      "title": "Motivations",
      "lines": [
        "La motivation principale est pédagogique : je voulais m'essayer à la manipulation d'une image SVG avec du JavaScript.",
        "Le choix du support s'est fait sur une vieille envie : je voulais re-créer le jeu <em>Asteroïds</em>. Et c'est après avoir suivi quelques-uns des <em>Coding Challenges</em> de <a href=\"https://www.youtube.com/user/shiffman\" target=\"blank\"> Daniel Shiffman</a> portant sur des moteurs physiques que je me suis lancé dans l'aventure.",
        "On est encore loin du véritable <em>Asteroïds</em> mais je suis assez content du résultat : la fusée est pilotable avec un peu d'entraînement et graphiquement, j'aime beaucoup le rendu vectoriel du SVG."
      ]
    },
    {
      "type": "Paragraph",
      "title": "Technologies mises en œuvre",
      "lines": [
        "Essentiellement JavaScript et SVG. L'affichage du jeu complet est fait dans une image SVG qui est modifiée dynamiquement par le moteur de jeu écrit en JavaScript.",
        "Évènements clavier et tactiles.",
        "Testé sur :",
        {
          "type": "List",
          "class": "",
          "items": [
            "Firefox (v64)",
            "Chrome (v71)",
            "Edge (v40)",
            "iOS Safari (v12)"
          ]
        },
        "Ne fonctionne pas sur Internet Explorer (v11)."
      ]
    }
  ]
}